console.log('Hello, world!')
// PascalCase тип и класс
// DB_PASSWORD значения известны до запуска приложения и не меняются
// camelCase все остальные переменные
// snake_case - реже
// объявление переменных  let const var(не рекомендуется)
let a // инструкция интерпретатуру джава скрипт создать переменную a (объявление переменной)
const c = 10 // здесь у нас объявление переменной с типа const и присваивание ей значения 10ж
a = true // присваивание значения переменной a
// разница ** при объявлении переменой типа let и присваивания ей значения мы можем также изменить
// значение присвоить ей новое значение, помимо этого мы можем объявить переменную но не присваивать ей значение,
// undefined мы также можем переприсваивать значениеб присваивать новое значение
// const  = оъбъявление и присваивание происходит сразу переприсваивание невозможно
// если мы не планируем присваить новые значение переменной предпочтильнее 
// использовать конст
